[{"Date":"2025-08-11","Distance":1.5,"Time":"00:15:01","AveragePace":"9:57","Notes":"First run of marathon training. Just tried to run at a very slow pace and see how my body felt. Ran into Ashley so ran with her for a bit. But I am really excited to get more milage down and strengthening my legs as I get closer to running the full marathon in November. Run felt really good!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-13","Distance":3.45,"Time":"00:30:12","AveragePace":"8:44","Notes":"Second run of training in the city. I just want to up my milage and strengthen my legs so my body gets used to running big distances. This is definitely going to be my hardest physical feat I have ever put my mind to. I am excited for the suffering I will have to endure in the near future to accomplish running my first marathon!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-14","Distance":2.17,"Time":"00:21:13","AveragePace":"9:44","Notes":"Third run of training was a chill night run. Least effort run so far just trying to get more milage in so my body can handle running 26 miles. It is crazy to me that I will be running a marathon in under three months. I honestly do not feel scared but excited for the challenge ahead. I have not done something this hard in a long time and I know I will grow from this experience. Anyways, going to prioritizing getting good rest every night and stretching!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-15","Distance":2.23,"Time":"00:20:31","AveragePace":"9:10","Notes":"I did not get a run in today so after Munachi's bday I decided to jog back to my apartment and I am very happy I did that. However, I just wore my sambas and it really hurt my feet so I need to make sure to always have my insoles in. Jogging at a slow pace is starting to feel good just need to up the milage!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-17","Distance":6.6,"Time":"00:59:17","AveragePace":"8:59","Notes":"Broke up the miles between me going to a bar to watch Manchester United play Arsenal and then going to get a beard trimmer at target. After hitting around the four mile mark I felt a runners high so once I hit this milage I will be flying. First week of marathon training has officially finished!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-19","Distance":2.18,"Time":"00:24:23","AveragePace":"11:11","Notes":"This run was supposed to be 3 miles long but I did not have enough time to do this. However, I feel like I definitely ran that much but the miles counter on the machine was not working properly. Anyways, this was the first treadmill run of training and I very much prefer running outside but this is really easy on the knees.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-20","Distance":5.02,"Time":"00:46:24","AveragePace":"9:14","Notes":"Did not feel like running today but I got in the miles with Ryan. I think I run faster by myself but I will have to test this hypothesis later on. I think this was the most difficult run so far but my body is starting to get used to running longer so I am very happy with my progress one week into training","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-22","Distance":3.13,"Time":"00:27:53","AveragePace":"8:55","Notes":"Morning run with Kaycie to jump in the lake. Body is feeling really good as I get these miles in. The weekly runs have been really good since I am almost done with week 2 of training. I have found that I run much better without music because I am fully concentrated on my breathing. So with the rest of my training no more music.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-24","Distance":6.04,"Time":"00:56:58","AveragePace":"9:25","Notes":"Second long run. This one felt really good. My body is getting used to the long runs and mentally I feel extremely strong. Went at a slow pace too so I will gradually improve that as time goes on by. My main priority now is to do leg and body workouts along with running for the upcoming weeks so I become my strongest physical self. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-26","Distance":2.96,"Time":"00:26:53","AveragePace":"9:03","Notes":"First run of week 3. My legs are feeling really good and have started to incorporate full body workouts into my week. But on this run I did not stop much and ran throughout which is something that I need to do a better job of because in the city I generally just stop a lot at traffic stops for example. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-27","Distance":6.04,"Time":"00:56:32","AveragePace":"9:21","Notes":"Not feeling as sore after these six mile runs which means that my legs are getting much stronger. Going to have to increase my pace for shorter runs in the coming weeks so that my average pace gets faster before running the entire marathon.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-08-28","Distance":2.32,"Time":"00:20:31","AveragePace":"8:49","Notes":"Me and Kaycie broke things off so I just needed to clear my head so I went on this run. Mental health run :) ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-01","Distance":7.51,"Time":"01:12:40","AveragePace":"9:41","Notes":"Week three of Madison marathon training has officially come to an end. Running a forest preserve is also such a good vibe and I want to most definitely include these types of runs in the future. Also, me and Kaycie have officially broken things off so running is going to be a really good outlet for moving on in the near future. The long run felt really good I just need to do a better job of when I am tired to jog slowly and not walk because that would really improve my overall time. Going to buy a running belt too in the very near future as well!","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-03","Distance":6.85,"Time":"01:02:21","AveragePace":"9:06","Notes":"Ran from my new apartment in Bucktown to Lincoln park and it was such a vibe. I just need to make sure I stretch well after run and eat a lot of food. My legs are starting to feel extremely good just have to keep strengthening them at the gym which is exactly what I am planning to do tomorrow at Depaul. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-05","Distance":1.84,"Time":"00:17:46","AveragePace":"9:38","Notes":"Did a full body workout yesterday and my legs were sore so I just decided to get a short run in to shake out my legs so I can get ready for my 10 mile run this Sunday.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-07","Distance":10.02,"Time":"01:45:41","AveragePace":"10:33","Notes":"This run was a very difficult one from miles 2-6.5 where my feet would go numb. But after the 6.5 mile mark everything was fine which was weird so might need new run shoes. My first double digit milage run felt amazing. I just have to do a better job of walking less and doing a really brisk jog instead.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-08","Distance":0.8,"Time":"00:06:49","AveragePace":"8:27","Notes":"On the way to get some groceries from aldi but I wanted to move my legs a bit after my ten mile long run.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-09","Distance":1.23,"Time":"00:13:53","AveragePace":"11:17","Notes":"Very easy jog after work.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-10","Distance":4.3,"Time":"00:38:32","AveragePace":"8:58","Notes":"Got a run in after hitting a pull day to play in a kickball game. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-14","Distance":13.44,"Time":"02:12:14","AveragePace":"9:50","Notes":"First half marathon in the books and it felt amazing. Went very slow but my legs feel very good after this run.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-15","Distance":1.35,"Time":"00:11:50","AveragePace":"8:46","Notes":"Real easy run to wicker park to juggle the ball around with miles.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-18","Distance":3.69,"Time":"00:33:42","AveragePace":"9:07","Notes":"Just went on a run after work. Just explored the neighborhood a bit.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-21","Distance":11.03,"Time":"01:44:51","AveragePace":"9:30","Notes":"The miles are starting to feel really good. Ran along the lakeshore path for the first time in a while which felt really good. Looking forward to see how I do with 16 miles next week. Ill use gels and my running belt for that one which is going to be very much needed. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-25","Distance":1.64,"Time":"00:14:00","AveragePace":"8:30","Notes":"Easy run around the neighborhood","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-26","Distance":3.03,"Time":"00:26:51","AveragePace":"8:52","Notes":"Another chill run around the neighborhood","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-28","Distance":3.0,"Time":"00:29:26","AveragePace":"9:49","Notes":"I was supposed to run 16 miles but I was extremely sore from soccer the previous day so I just decided to relax and have a recovery run with Ryan.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-09-30","Distance":6.47,"Time":"01:02:23","AveragePace":"9:38","Notes":"Tried out gels for the first time which felt really good in terms of giving me more energy. But I am trying to get my milage up a bit now since I missed my last long run and get back to it in terms of hitting the necessary milage in my training. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-06","Distance":2.85,"Time":"00:26:38","AveragePace":"9:19","Notes":"Chill run along the 606. I was testing out the gels which I will be using on my longer runs.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-07","Distance":3.02,"Time":"00:27:36","AveragePace":"9:08","Notes":"Light run around the neighborhood. ","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-08","Distance":2.86,"Time":"00:27:58","AveragePace":"9:46","Notes":"Light run. Trying to up my mileage because I have really been slacking lately. Preparing my legs for 15 mile run this Saturday which I am really looking forward to.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-11","Distance":5.52,"Time":"00:52:30","AveragePace":"9:31","Notes":"Ran to a bar to watch the Cubs game and ran home from Will birthday party","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-12","Distance":1.03,"Time":"00:08:49","AveragePace":"8:30","Notes":"Ran to my soccer game because the Chicago Marathon was blocking the bus route. It was really inspiring seeing all the runners and makes me want to run the Chicago Marathon in the future.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-13","Distance":16.02,"Time":"02:49:11","AveragePace":"10:34","Notes":"First long long run which felt pretty good","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-19","Distance":6.85,"Time":"01:10:05","AveragePace":"10:14","Notes":"While visiting Andrew in Seattle I decided to go on a run around Seattle and check out University of Washington as well. Was a really enjoyable run which has inspired me to run in whatever city I am in from now on","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-10-24","Distance":20.06,"Time":"03:48:50","AveragePace":"11:24","Notes":"Longest run before the marathon. Started to cramp up after mile 13.1 but ate a banana and drank a lot of fluids and I was good. Really looking forward to the marathon coming up in two weeks","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-11-05","Distance":0.98,"Time":"00:09:14","AveragePace":"9:22","Notes":"Light run before I run my marathon. Wanted to get the legs moving because the long run really took a toll on me and I wanted to rest my body fully.","RunGoal":"Madison Marathon 11-9-2025"},{"Date":"2025-11-09","Distance":26.2,"Time":"04:43:05","AveragePace":"10:49","Notes":"The coldest I have run in and it so happened to be marathon day. I ran at a very steady pace the entire way. Very proud of myself for my performance. My goal was to finish the race and I did so. Looking forward to the next marathon I do and going sub 4!!!","RunGoal":"Madison Marathon 11-9-2025"}]
